Tekla Open API Reference for Tekla Structures 2025
AnalysisPosition Methods
The AnalysisPosition type exposes the following members.
Methods
Name | Description
Select
 Selects an analysis position.
 (Overrides AnalysisObject.Select().)
Top
See Also
Reference
AnalysisPosition Class
Tekla.Structures.Analysis Namespace